Repository: Djdany95/MyWatchList
Catalog: src/locale/messages.*.xlf
Languages: es, gl

# error500
source: <h1>ERROR 500</h1> <h2>RESTRICTED ACCESS TO USERS</h2>
es: <h1> ERROR 500 </h1> <h2> ACCESO RESTRINGIDO A USUARIOS </h2>

# profileErrors
source: <span>Password is incorrect.</span> <span>URL is incorrect.</span> <span>Image changed.</span> <span>Password changed.</span>
es: <span> Contraseña es incorrecta. </span> <span> URL es incorrecta. </span> <span> Imagen cambiada. </span> <span> Contraseña cambiada. </span>

# confirmJumbo
source: <h1>Hello, new Lister!</h1> <hr/> <p>You are now registered.</p> <p> <a>Go to MyWatchList</a> </p>
es: <h1> ¡Email confirmado! </h1> <hr/> <p> Ya estás registrado. </p> <p> <a> Ir a MyWatchList </a> </p>

# confirmErrors
source: <span>Email confirmed.</span> <span>Server Error 500. Try it later.</span>
es: <span> Email confirmado. </span> <span> Server Error 500. Inténtalo de nuevo más tarde. </span>

# seriesDetails
source: <ng-progress></ng-progress> <div> <div> <h1>{{series.Title}} {{series.imdbRating}}/10</h1> </div> </div> <div> <div> <img/> </div> <div> <h4>PLOT</h4> <p></p> <h4>GENRE</h4> <p></p> <h4>COUNTRY</h4> <p></p> <h4>RELEASED</h4> <p></p> <h4>TOTAL SEASONS</h4> <p></p> <h4>RUNTIME</h4> <p></p> </div> </div> <h2>CAST</h2> <div> <div> <h4>DIRECTOR</h4> <p>Unknown Director</p> <div> <ul> <a> {{director}} </a> </ul> </div> </div> <div> <h4>WRITER</h4> <p>Unknown Writer</p> <div> <ul> <a> {{writer}} </a> </ul> </div> </div> <div> <h4>ACTORS</h4> <p>Unknown Actors</p> <div> <ul> <a> {{actor}} </a> </ul> </div> </div> </div>
es: <div> <div> <h1> {{series.Title}} {{series.imdbRating}} /10 </h1> </div> </div> <div> <div> <img/> </div> <div> <h4> SINOPSIS </h4> <p> </p> <h4> GENERO </h4> <p> </p> <h4> PAÍS </h4> <p> </p> <h4> AÑO </h4> <p> </p> <h4> TEMPORADAS TOTALES </h4> <p> </p> <h4> DURACION </h4> <p> </p> </div> </div> <h2> REPARTO </h2> <div> <div> <h4> DIRECTOR </h4> <p> Director desconocido </p> <div> <ul> <a> {{director}} </a> </ul> </div> </div> <div> <h4> GUIONISTA </h4> <p> Guionista desconocido </p> <div> <ul> <a> {{writer}} </a> </ul> </div> </div> <div> <h4> ACTORES </h4> <p> Actores desconocidos </p> <div> <ul> <a> {{actor}} </a> </ul> </div> </div> </div>

# detailsReturn
source: Return to MyWatchList
es: Volver a MyWatchList
gl: Volver a MyWatchList

# insertForm
source: <mat-expansion-panel> <mat-expansion-panel-header> <mat-panel-title> Insert </mat-panel-title> <mat-panel-description> New Series </mat-panel-description> </mat-expansion-panel-header> <mat-form-field> <input/> <mat-placeholder>Name</mat-placeholder> <mat-autocomplete> <mat-option> {{ option.title }} </mat-option> </mat-autocomplete> <mat-error> Name is <strong>required</strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-placeholder>Season</mat-placeholder> <mat-error> Season is <strong>required</strong> </mat-error> <mat-error> Season must be a <strong>number</strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-placeholder>Actual Episode</mat-placeholder> <mat-error> Episode is <strong>required</strong> </mat-error> <mat-error> Episode must be a <strong>number</strong> </mat-error> </mat-form-field> <div> <button> Insert <mat-icon>add_circle</mat-icon> </button> </div> </mat-expansion-panel>
es: <mat-expansion-panel> <mat-expansion-panel-header> <mat-panel-title> Insertar </mat-panel-title> <mat-panel-description> Serie Nueva </mat-panel-description> </mat-expansion-panel-header> <mat-form-field> <input/> <mat-placeholder> Nombre (ORIGINAL) </mat-placeholder> <mat-autocomplete> <mat-option> {{ option }} </mat-option> </mat-autocomplete> <mat-error> Nombre es <strong> obligatorio </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-placeholder> Temporada </mat-placeholder> <mat-error> Temporada es <strong> obligatoria </strong> </mat-error> <mat-error> Temporada tiene que ser un <strong> número </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-placeholder> Episodio Actual </mat-placeholder> <mat-error> Episodio es <strong> obligatorio </strong> </mat-error> <mat-error> Episodio tiene que ser un <strong> número </strong> </mat-error> </mat-form-field> <div> <button> Insertar <mat-icon> add_circle </mat-icon> </button> </div> </mat-expansion-panel>

# registerForm
source: <div> <div> <mat-form-field> <input/> <mat-error> Username is <strong>required</strong> </mat-error> <mat-error> Username is too <strong>short</strong> </mat-error> </mat-form-field> </div> <div> <mat-form-field> <input/> <mat-error> Email is <strong>required</strong> </mat-error> <mat-error> Email is <strong>incorrect</strong> </mat-error> </mat-form-field> </div> <div></div> <div> <mat-form-field> <input/> <mat-error> Password is <strong>required</strong> </mat-error> <mat-error> Password is too <strong>weak</strong> </mat-error> </mat-form-field> </div> <div> <mat-form-field> <input/> <mat-error> Password is <strong>required</strong> </mat-error> <mat-error> Passwords doesn't <strong>match</strong> </mat-error> </mat-form-field> </div> <div> <button>Register</button> <button>Register</button> </div> </div>
es: <div> <div> <mat-form-field> <input/> <mat-error> Usuario es <strong> obligatorio </strong> </mat-error> <mat-error> Usuario es <strong> muy corto </strong> </mat-error> </mat-form-field> </div> <div> <mat-form-field> <input/> <mat-error> Email es <strong> obligatorio </strong> </mat-error> <mat-error> Email es <strong> incorrecto </strong> </mat-error> </mat-form-field> </div> <div> </div> <div> <mat-form-field> <input/> <mat-error> Contraseña es <strong> obligatoria </strong> </mat-error> <mat-error> Contraseña es <strong> débil </strong> </mat-error> </mat-form-field> </div> <div> <mat-form-field> <input/> <mat-error> Contraseña es <strong> obligatoria </strong> </mat-error> <mat-error> Las contraseñas <strong> no coinciden </strong> </mat-error> </mat-form-field> </div> <div> <button> Registrar </button> <button> Registrar </button> </div> </div>

# registerUser
source: Username
es: Nombre de usuario
gl: Nome de usuario

# registerPass
source: Password
es: Contraseña
gl: Contrasinal

# registerPass2
source: Repeat Password
es: Repetir Contraseña
gl: Repetir Contrasinal

# registerErrors
source: <span>Error! Username already exists.</span> <span>Error! Email already exists.</span>
es: <span> ¡Error! Usuario ya existe. </span> <span> ¡Error! Email ya existe. </span>

# feedbackMsg
source: Input your feedback...
es: Escribe tu feedback...
gl: Escribe teu feedback...

# feedbackErrors
source: <span>Your feedback was sent.</span> <span>Error! Please try it later.</span>
es: <span> Has enviado el feedback. </span> <span> ¡Error! Por favor inténtalo más tarde. </span>

# headerList
source: <button> <mat-icon>brightness_medium </mat-icon> </button> <span> <img/> <i> {{user.name | titlecase}}'s </i> List <button> <mat-icon>account_box </mat-icon> </button> </span> <button> <mat-icon>exit_to_app </mat-icon> </button>
gl: <button> <mat-icon>brightness_medium </mat-icon> </button> <span> <img/>Lista de <i> {{user.name | titlecase}} </i> <button> <mat-icon>account_box </mat-icon> </button> </span> <button> <mat-icon>exit_to_app </mat-icon> </button>

# list
source: <div> <mat-form-field> <input/> <mat-placeholder>Filter </mat-placeholder> </mat-form-field> </div> <mat-table> <ng-container> <mat-header-cell> On Air </mat-header-cell> <mat-cell> <mat-icon>check_box </mat-icon> <mat-icon>indeterminate_check_box </mat-icon> </mat-cell> </ng-container> <ng-container> <mat-header-cell> Name </mat-header-cell> <mat-cell> {{element.name}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> Season </mat-header-cell> <mat-cell> {{element.temp}} <button> <mat-icon>add_circle </mat-icon> </button> </mat-cell> </ng-container> <ng-container> <mat-header-cell> Actual Episode </mat-header-cell> <mat-cell> {{element.epA}} <button> <mat-icon>add_circle </mat-icon> </button> </mat-cell> </ng-container> <ng-container> <mat-header-cell> </mat-header-cell> <mat-cell> <button> <mat-icon>delete </mat-icon> </button> <button> <mat-icon>edit </mat-icon> </button> <button> <mat-icon>info </mat-icon> </button> </mat-cell> </ng-container> <mat-header-row> </mat-header-row> <mat-row> </mat-row> </mat-table>
gl: <div> <mat-form-field> <input/> <mat-placeholder>Filtro </mat-placeholder> </mat-form-field> </div> <mat-table> <ng-container> <mat-header-cell> En emisión </mat-header-cell> <mat-cell> <mat-icon>check_box </mat-icon> <mat-icon>indeterminate_check_box </mat-icon> </mat-cell> </ng-container> <ng-container> <mat-header-cell> Nome </mat-header-cell> <mat-cell> {{element.name}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> Tempada </mat-header-cell> <mat-cell> {{element.temp}} <button> <mat-icon>add_circle </mat-icon> </button> </mat-cell> </ng-container> <ng-container> <mat-header-cell> Episodio Actual </mat-header-cell> <mat-cell> {{element.epA}} <button> <mat-icon>add_circle </mat-icon> </button> </mat-cell> </ng-container> <ng-container> <mat-header-cell> </mat-header-cell> <mat-cell> <button> <mat-icon>delete </mat-icon> </button> <button> <mat-icon>edit </mat-icon> </button> <button> <mat-icon>info </mat-icon> </button> </mat-cell> </ng-container> <mat-header-row> </mat-header-row> <mat-row> </mat-row> </mat-table>

# listNSeries
source: Following {{nSeries}} series
gl: Seguindo {{nSeries}} series

# error500
source: <h1>ERROR 500 </h1> <h2>RESTRICTED ACCESS TO USERS </h2>
gl: <h1>ERROR 500 </h1> <h2>ACCESO RESTRINXIDO A USUARIOS </h2>

# listErrors
source: <span>Series is already in your list. </span> <span> doesn't follow any series. </span> <span>Added success. </span> <span>Edited success. </span> <span>Deleted success. </span> <span>Logout success. </span>
gl: <span>A serie xa está na túa lista. </span> <span> non segue ningunha serie. </span> <span>Añadida. </span> <span>Editada. </span> <span>Borrada. </span> <span>Sesión pechada. </span>

# editHeader
source: Edit {{data.s.name}}
gl: Editar {{data.s.name}}

# editContent
source: <mat-form-field> <input/> </mat-form-field> <mat-form-field> <input/> <mat-checkbox> On Air </mat-checkbox> </mat-form-field> <mat-form-field> <input/> <mat-error> Season is <strong>required </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-error> Actual Episode is <strong>required </strong> </mat-error> </mat-form-field>
gl: <mat-form-field> <input/> </mat-form-field> <mat-form-field> <input/> <mat-checkbox> En Emisión </mat-checkbox> </mat-form-field> <mat-form-field> <input/> <mat-error> Tempada é <strong>obrigatoria </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-error> Episodio actual é <strong>obrigatorio </strong> </mat-error> </mat-form-field>

# editButtons
source: <button>Cancel </button> <button>Edit </button>
gl: <button>Cancelar </button> <button>Editar </button>

# introJumbo
source: <app-lang-selector> </app-lang-selector> <h1>Welcome to MyWatchList! </h1> <h1>Welcome to MyWatchList! </h1> <p>This is a simple page to track all Series you follow and share it with your friends. </p> <hr/> <br/> <h4>Register now to become a Lister </h4> <div> <app-register-form> </app-register-form> </div> <br/> <br/> <br/>
gl: <app-lang-selector> </app-lang-selector> <h1>Benvido a MyWatchList! </h1> <h1>Benvido a MyWatchList! </h1> <p>Esta é unha simple web para facer seguimento das series que segues e compartila cos teus amigos. </p> <hr/> <br/> <h4>Rexístrate agora para ser un Lister </h4> <div> <app-register-form> </app-register-form> </div> <br/> <br/> <br/>

# introCookies
source: <div> <button> <span>× </span> </button> <h5> <button> Cookies... </button> </h5> </div> <div> <div> We use own cookies and third party cookies to obtain statistics data of our users and improve our services. If accepts or you continues navigating, we understund you accept their use. You can change configurations or obtain more information <a>here </a>. </div> </div>
gl: <div> <button> <span>× </span> </button> <h5> <button> Cookies... </button> </h5> </div> <div> <div> Utilizamos cookies propias e de terceiros para obter datos estadísticos da navegación dos nosos usuarios e mellorar os nosos servizos. Si acepta ou continúa navegando, consideramos que acepta seu uso. Pode cambiar a configuración u obter mais información <a>aquí </a>. </div> </div>

# introErrors
source: <span>Registered successfully. Please confirm email. </span> <span>Error! Please confirm email. </span> <span>Error! User or password are incorrect. </span> <span>Sent credentials to </span> <span>Error! Email doesn't exists. </span> <span>Server Error! Please try later. </span>
gl: <span>Rexistrado! Por favor confirma o email. </span> <span>Error! Por favor confirma o email. </span> <span>Error! Usuario ou contrasinal incorrectos. </span> <span>Enviadas credenciales a </span> <span>Error! Email non existe. </span> <span>Server Error! Por favor intentalo máis tarde. </span>

# loginContent
source: <mat-form-field> <input/> <mat-error> Username is <strong>required </strong> </mat-error> <mat-error> Username is too <strong>short </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-error> Password is <strong>required </strong> </mat-error> <mat-error> Password is too <strong>weak </strong> </mat-error> </mat-form-field>
gl: <mat-form-field> <input/> <mat-error> Usuario é <strong>obrigatorio </strong> </mat-error> <mat-error> Usuario é demasiado <strong>corto </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-error> Contrasinal é <strong>obrigatoria </strong> </mat-error> <mat-error> Contrasinal é demasiado <strong>débil </strong> </mat-error> </mat-form-field>

# forgot
source: <button>Forgot username or password? </button>
gl: <button>Olvidaste usuario ou contrasinal? </button>

# loginButtons
source: <button>Cancel </button> <button>Login </button>
gl: <button>Cancelar </button> <button>Iniciar sesión </button>

# forgotContent
source: <mat-form-field> <input/> <mat-error> Email is <strong>required </strong> </mat-error> <mat-error> Email is <strong>incorrect </strong> </mat-error> </mat-form-field>
gl: <mat-form-field> <input/> <mat-error> Email é <strong>obrigatorio </strong> </mat-error> <mat-error> Email é <strong>incorrecto </strong> </mat-error> </mat-form-field>

# forgotButtons
source: <button>Cancel </button> <button>Send </button>
gl: <button>Cancelar </button> <button>Enviar </button>

# cookies
source: <p>In compliance with the provisions of article 22.2 of Law 34/2002, of July 11, Services of the Information Society and Electronic Commerce, this website informs you, in this section, about the <strong>cookie collection and treatment policy </strong>. </p> <p> </p> <h3> <span>What are the cookies? </span> </h3> <p> <span>A cookie is a file that is downloaded to your computer when you access certain web pages. Cookies allow a web page, among other things, to store and retrieve information about the browsing habits of a user or their equipment and, depending on the information they contain and the way they use their equipment, they can be used to recognize to user. </span> </p> <p> </p> <h3>What kind of cookies use this web? </h3> <p>This website uses the following types of cookies: </p> <p> <span> <strong>Analysis cookies </strong> </span>: Are those that well treated by us or by third parties, allow us to quantify the number of users and thus perform the measurement and statistical analysis of the use made by users of the service offered. To do this, we analyze your browsing on our website in order to improve the offer of products or services we offer you. </p> <p> <span> <strong>Technical cookies </strong> </span>: Are those that allow the user to navigate through the restricted area and the use of its different functions, such as, for example, bringing the process of purchasing an article. </p> <p> <strong> <span>Personalization cookies </span> </strong>: Are those that allow the user to access the service with some predefined general characteristics based on a series of criteria in the user's terminal, such as the language or type of browser through which the user connects to the service. </p> <p> <strong> <span>Advertising cookies </span> </strong>: Are those that, well treated by this website or by third parties, allow to manage in the most efficient way possible the offer of the advertising spaces that are on the web page, adapting the content of the advertisement to the content of the service requested or to the use made from our website. For this we can analyze your browsing habits on the Internet and we can show you advertisements related to your browsing profile. </p> <p> <span> <strong>Behavioral advertising cookies </strong> </span>: Are those that allow the management, in the most efficient way possible, of the advertising spaces that, where appropriate, the editor has included in a web page, application or platform from which it provides the requested service. This type of cookies stores information on the behavior of visitors obtained through the continuous observation of their browsing habits, which allows the development of a specific profile to display advertisements based on it. </p> <p> </p> <h3>Deactivate cookies. </h3> <p>You can <strong>allow, block or delete cookies </strong> installed on your computer by configuring the browser options installed on your computer. </p> <p>In most web browsers the possibility of allowing, blocking or eliminating the cookies installed on your computer is offered. </p> <p>You can then access the configuration of the most frequent web browsers to accept, install or deactivate cookies: </p> <p> <a>Configure cookies in Google Chrome </a> </p> <p> <a>Configure cookies in Microsoft Internet Explorer </a> </p> <p> <a>Configure cookies in Mozilla Firefox </a> </p> <p> <a>Configure cookies in Safari (Apple) </a> </p> <p> </p> <h3>Third party cookies. </h3> <p>This website uses third-party services to collect information for statistical purposes and use of the web. DoubleClick cookies are used to improve the advertising that is included in the website. They are used to guide advertising according to the content that is relevant to a user, thus improving the quality of experience in its use. </p> <p>Specifically, we use Google Adsense and Google Analytics services for our statistics and advertising. Some cookies are essential for the operation of the site, for example the built-in search engine. </p> <p>Our site includes other features provided by third parties. You can easily share the content on social networks like Facebook, Twitter or Google +, with the buttons that we have included for that purpose. </p> <br/> <h4>Warning about deleting cookies. </h4> <p>You can delete and block all cookies from this site, but part of the site will not work or the quality of the website may be affected. </p> <button>I Undestand </button>
gl: <p>En cumprimento co disposto no artígo 22.2 da Ley 34/2002, de 11 de xulio, de Servizos da Sociedade da Información e de Comercio Electrónico, esta páxina web lle informa, nesta sección, sobre a <strong>política de recoxida e tratamento de cookies </strong>. </p> <p> </p> <h3> <span>Qué son as cookies? </span> </h3> <p> <span>Unha cookie é un fichero que se descarga no seu ordenador ó acceder a determinadas páxinas web. As cookies permiten a unha páxina web, entre outras cousas, almacear e recuperar información sobre os hábitos de navegación dun usuario ou do seu equipo e, dependendo da información que contengan e da forma en que utilice seu equipo, poden utilizarse para reconocer ó usuario. </span> </p> <p> </p> <h3>Qué tipos de cookies utiliza esta páxina web? </h3> <p>Esta páxina web utiliza os siguientes tipos de cookies: </p> <p> <span> <strong>Cookies de análise </strong> </span>: Son aquelas que ben tratadas por nos ou por terceiros, nos permiten cuantificar o número de usuarios e así realizar a medición e análise estadístico da utilización que fan os usuarios do servicio ofertado. Para elo se analiza súa navegación na nosa páxina web co fin de mellorar a oferta de productos ou servizos que lle ofrecemos. </p> <p> <span> <strong>Cookies técnicas </strong> </span>: Son aquelas que permiten ó usuario a navegación a través do área restrinxida e a utilización de súas diferentes funcións, como por exemplo, levar a cambio o proceso de compra dun artígo. </p> <p> <strong> <span>Cookies de personalización </span> </strong>: Son aquelas que permiten ó usuario acceder ó servizo con algunhas características de carácter xeral predefinidas en función dunha serie de criterios no terminal do usuario como por exemplo serían o idioma ou o tipo de navegador a través do cal se conecta ó servizo. </p> <p> <strong> <span>Cookies publicitarias </span> </strong>: Son aquelas que, ben tratadas por esta web ou por terceiros, permiten xestionar da forma máis eficaz posible a oferta dos espazos publicitarios que hay na páxina web, adecuando o contido do anuncio ó contido do servizo solicitado ou ó uso que realice da nosa páxina web. Para elo podemos analizar seus hábitos de navegación en Internet e podemos mostrarlle publicidad relacioada co seu perfil de navegación. </p> <p> <span> <strong>Cookies de publicidad comportamental </strong> </span>: Son aquelas que permiten a xestión, da forma más eficaz posible, dos espacios publicitarios que, no seu caso, o editor haxa incluido na páxina web, aplicación ou prataforma dende a que presta o servizo solicitado. Este tipo de cookies almacenan información do comportamiento dos visitantes obtida a través da observación continuada de seus hábitos de navegación, o que permite desenrolar un perfil específico para mostrar avisos publicitarios en función do mesmo. </p> <p> </p> <h3>Desactivar as cookies. </h3> <p>Pode vostede <strong>permitir, bloquear ou eliminar as cookies </strong> instaladas no seu equipo mediante a configuración das opciones do navegador instalado no seu ordenador. </p> <p>Na mayoría dos navegadores web se ofrece a posibilidade de permitir, bloquear ou eliminar as cookies instaladas no seu equipo. </p> <p>A continuación pode acceder á configuración dos navegadores webs más frecuentes para aceptar, instalar ou desactivar as cookies: </p> <p> <a>Configurar cookies en Google Chrome </a> </p> <p> <a>Configurar cookies en Microsoft Internet Explorer </a> </p> <p> <a>Configurar cookies en Mozilla Firefox </a> </p> <p> <a>Configurar cookies en Safari (Apple) </a> </p> <p> </p> <h3>Cookies de terceiros. </h3> <p>Esta páxina web utiliza servizos de terceiros para recopilar información con fines estadísticos e de uso da web. Se usan cookies de DoubleClick para mejorar a publicidade que se incluye no sitio web. Son utilizadas para orientar a publicidad según o contenido que é relevante para un usuario, mellorando así a calidade de experiencia no uso do mesmo. </p> <p>En concreto, usamos os servicios de Google Adsense e de Google Analytics para nosas estadísticas e publicidad. Algunhas cookies son esenciales para o funcionamento do sitio, por exemplo o buscador incorporado. </p> <p>Noso sitio incluye outras funcionalidades proporcionadas por terceiros. Vostede pode fácilmente compartir o contenido en redes sociais como Facebook, Twitter ou Google +, cos botones que hemos incluido a tal efecto. </p> <br/> <h4>Advertencia sobre eliminar cookies. </h4> <p>Vostede pode eliminar e bloquear todas as cookies de este sitio, pero parte do sitio non funcionará ou a calidad da páxina web pode verse afectada. </p> <button>Entendido </button>

# headerShared
source: <br/> <h3> <button> <mat-icon>brightness_medium </mat-icon> </button> <img/> <i> {{userName | titlecase}}'s </i> Shared List </h3> <mat-divider> </mat-divider>
gl: <br/> <h3> <button> <mat-icon>brightness_medium </mat-icon> </button> <img/>Lista compartida de <i> {{userName | titlecase}} </i> </h3> <mat-divider> </mat-divider>
