Repository: Djdany95/MyWatchList
Catalog: src/locale/messages.*.xlf
Languages: es, gl

# listShared
source: <div> <mat-form-field> <input/> <mat-placeholder>Filter </mat-placeholder> </mat-form-field> </div> <mat-table> <ng-container> <mat-header-cell> On Air </mat-header-cell> <mat-cell> <mat-icon>check_box </mat-icon> <mat-icon>indeterminate_check_box </mat-icon> </mat-cell> </ng-container> <ng-container> <mat-header-cell> Name </mat-header-cell> <mat-cell> {{element.name}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> Season </mat-header-cell> <mat-cell> {{element.temp}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> Actual Episode </mat-header-cell> <mat-cell> {{element.epA}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> </mat-header-cell> <mat-cell> <button> <mat-icon>info </mat-icon> </button> </mat-cell> </ng-container> <mat-header-row> </mat-header-row> <mat-row> </mat-row> </mat-table>
gl: <div> <mat-form-field> <input/> <mat-placeholder>Filtro </mat-placeholder> </mat-form-field> </div> <mat-table> <ng-container> <mat-header-cell> En emisión </mat-header-cell> <mat-cell> <mat-icon>check_box </mat-icon> <mat-icon>indeterminate_check_box </mat-icon> </mat-cell> </ng-container> <ng-container> <mat-header-cell> Nome </mat-header-cell> <mat-cell> {{element.name}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> Tempada </mat-header-cell> <mat-cell> {{element.temp}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> Episodio Actual </mat-header-cell> <mat-cell> {{element.epA}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> </mat-header-cell> <mat-cell> <button> <mat-icon>info </mat-icon> </button> </mat-cell> </ng-container> <mat-header-row> </mat-header-row> <mat-row> </mat-row> </mat-table>

# shareNSeries
source: Following {{nSeries}} series
gl: Seguindo {{nSeries}} series

# shareErrors
source: <span> doesn't follow any series. </span> <span>Error! User doesn't exists. </span>
gl: <span> non segue ningunha serie. </span> <span>Error! Usuario non existe. </span>

# profileHeader
source: <br/> <h3> <button> <mat-icon>format_list_bulleted </mat-icon> </button> <img/> <i> {{user.name | titlecase}}'s </i> Profile <button> <mat-icon>exit_to_app </mat-icon> </button> </h3> <mat-divider> </mat-divider> <span>Following {{nSeries}} series </span>
gl: <br/> <h3> <button> <mat-icon>format_list_bulleted </mat-icon> </button> <img/>Perfil de <i> {{user.name | titlecase}} </i> <button> <mat-icon>exit_to_app </mat-icon> </button> </h3> <mat-divider> </mat-divider> <span>Seguindo {{nSeries}} series </span>

# changePassForm
source: <mat-expansion-panel> <mat-expansion-panel-header> <mat-panel-title> Change Password </mat-panel-title> </mat-expansion-panel-header> <mat-form-field> <input/> <mat-placeholder>Actual Password </mat-placeholder> <mat-error> Password is <strong>required </strong> </mat-error> <mat-error> Password is too <strong>weak </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-placeholder>New Password </mat-placeholder> <mat-error> Password is <strong>required </strong> </mat-error> <mat-error> Password is too <strong>weak </strong> </mat-error> </mat-form-field> <div> <button> Change Password <mat-icon>edit </mat-icon> </button> </div> </mat-expansion-panel>
gl: <mat-expansion-panel> <mat-expansion-panel-header> <mat-panel-title> Cambiar contrasinal </mat-panel-title> </mat-expansion-panel-header> <mat-form-field> <input/> <mat-placeholder>Contrasinal actual </mat-placeholder> <mat-error> Contrasinal é <strong>obrigatoria </strong> </mat-error> <mat-error> Contrasinal é demasiado <strong>débil </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-placeholder>Nova Contrasinal </mat-placeholder> <mat-error> Contrasinal é <strong>obrigatoria </strong> </mat-error> <mat-error> Contrasinal é demasiado <strong>débil </strong> </mat-error> </mat-form-field> <div> <button> Cambiar Contrasinal <mat-icon>edit </mat-icon> </button> </div> </mat-expansion-panel>

# changeImageForm
source: <mat-expansion-panel> <mat-expansion-panel-header> <mat-panel-title> Change Profile Image </mat-panel-title> </mat-expansion-panel-header> <mat-form-field> <input/> <mat-placeholder>URL to image </mat-placeholder> <mat-error> URL is <strong>required </strong> </mat-error> <mat-error> URL is <strong>incorrect </strong> </mat-error> </mat-form-field> <div> <button> Change Profile Image <mat-icon>account_circle </mat-icon> </button> </div> </mat-expansion-panel>
gl: <mat-expansion-panel> <mat-expansion-panel-header> <mat-panel-title> Cambiar imaxen de perfil </mat-panel-title> </mat-expansion-panel-header> <mat-form-field> <input/> <mat-placeholder>URL da imaxen </mat-placeholder> <mat-error> URL é <strong>obrigatoria </strong> </mat-error> <mat-error> URL é <strong>incorrecta </strong> </mat-error> </mat-form-field> <div> <button> Cambiar imaxen de perfil <mat-icon>account_circle </mat-icon> </button> </div> </mat-expansion-panel>

# deleteModal
source: <div> <div> <div> <h5>Confirm Delete Account </h5> <button> <span>× </span> </button> </div> <div> Really do you want delete your account definitely? <br/> This can not be reversed! </div> <div> <button>Cancel </button> <button>Delete </button> </div> </div> </div>
gl: <div> <div> <div> <h5>Confirmar borrado </h5> <button> <span>× </span> </button> </div> <div> Realmente queres borrar a conta? <br/> Esto non pode revertirese! </div> <div> <button>Cancelar </button> <button>Borrar </button> </div> </div> </div>

# error500
source: <h1>ERROR 500 </h1> <h2>RESTRICTED ACCESS TO USERS </h2>
gl: <h1>ERROR 500 </h1> <h2>ACCESO RESTRINXIDO A USUARIOS </h2>

# profileErrors
source: <span>Password is incorrect. </span> <span>URL is incorrect. </span> <span>Image changed. </span> <span>Password changed. </span>
gl: <span>Contrasinal é incorrecta. </span> <span>URL é incorrecta. </span> <span>Imaxen cambiada. </span> <span>Contrasinal cambiada. </span>

# confirmJumbo
source: <h1>Email Confirmed! </h1> <hr/> <p>You are now registered. </p> <p> <a>Go to MyWatchList </a> </p>
gl: <h1>Email confirmado! </h1> <hr/> <p>Xa estás rexistrado. </p> <p> <a>Ir a MyWatchList </a> </p>

# confirmErrors
source: <span>Email confirmed. </span> <span>Server Error 500. Try it later. </span>
gl: <span>Email confirmado. </span> <span>Server Error 500. Inténtalo de novo máis tarde. </span>

# seriesDetails
source: <div> <div> <h1> {{series.Title}} {{series.imdbRating}}/10 </h1> </div> </div> <div> <div> <img/> </div> <div> <h4>PLOT </h4> <p> </p> <h4>GENRE </h4> <p> </p> <h4>COUNTRY </h4> <p> </p> <h4>YEAR </h4> <p> </p> <h4>TOTAL SEASONS </h4> <p> </p> <h4>RUNTIME </h4> <p> </p> </div> </div> <h2>CAST </h2> <div> <div> <h4>DIRECTOR </h4> <p>Unknown Director </p> <div> <ul> <a> {{director}} </a> </ul> </div> </div> <div> <h4>WRITER </h4> <p>Unknown Writer </p> <div> <ul> <a> {{writer}} </a> </ul> </div> </div> <div> <h4>ACTORS </h4> <p>Unknown Actors </p> <div> <ul> <a> {{actor}} </a> </ul> </div> </div> </div>
gl: <div> <div> <h1> {{series.Title}} {{series.imdbRating}}/10 </h1> </div> </div> <div> <div> <img/> </div> <div> <h4>SINOPSIS </h4> <p> </p> <h4>XENERO </h4> <p> </p> <h4>PAIS </h4> <p> </p> <h4>ANO </h4> <p> </p> <h4>TEMPADAS TOTAIS </h4> <p> </p> <h4>DURACION </h4> <p> </p> </div> </div> <h2>REPARTO </h2> <div> <div> <h4>DIRECTOR </h4> <p>Director desconocido </p> <div> <ul> <a> {{director}} </a> </ul> </div> </div> <div> <h4>GUIONISTA </h4> <p>Guionista desconocido </p> <div> <ul> <a> {{writer}} </a> </ul> </div> </div> <div> <h4>ACTORES </h4> <p>Actores desconocidos </p> <div> <ul> <a> {{actor}} </a> </ul> </div> </div> </div>

# insertForm
source: <mat-expansion-panel> <mat-expansion-panel-header> <mat-panel-title> Insert </mat-panel-title> <mat-panel-description> New Series </mat-panel-description> </mat-expansion-panel-header> <mat-form-field> <input/> <mat-placeholder>Name </mat-placeholder> <mat-autocomplete> <mat-option> {{ option }} </mat-option> </mat-autocomplete> <mat-error> Name is <strong>required </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-placeholder>Season </mat-placeholder> <mat-error> Season is <strong>required </strong> </mat-error> <mat-error> Season must be a <strong>number </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-placeholder>Actual Episode </mat-placeholder> <mat-error> Episode is <strong>required </strong> </mat-error> <mat-error> Episode must be a <strong>number </strong> </mat-error> </mat-form-field> <div> <button> Insert <mat-icon>add_circle </mat-icon> </button> </div> </mat-expansion-panel>
gl: <mat-expansion-panel> <mat-expansion-panel-header> <mat-panel-title> Insertar </mat-panel-title> <mat-panel-description> Serie Nova </mat-panel-description> </mat-expansion-panel-header> <mat-form-field> <input/> <mat-placeholder>Nome (ORIXINAL) </mat-placeholder> <mat-autocomplete> <mat-option> {{ option }} </mat-option> </mat-autocomplete> <mat-error> Nome é <strong>obrigatorio </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-placeholder>Tempada </mat-placeholder> <mat-error> Tempada é <strong>obrigatoria </strong> </mat-error> <mat-error> Tempada ten que ser un <strong>número </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-placeholder>Episodio Actual </mat-placeholder> <mat-error> Episodio é <strong>obrigatorio </strong> </mat-error> <mat-error> Episodio ten que ser un <strong>número </strong> </mat-error> </mat-form-field> <div> <button> Insertar <mat-icon>add_circle </mat-icon> </button> </div> </mat-expansion-panel>

# registerErrors
source: <span>Error! Username already exists. </span> <span>Error! Email already exists. </span>
gl: <span>Error! Usuario xa existe. </span> <span>Error! Email xa existe. </span>

# feedbackErrors
source: <span>Your feedback was sent. </span> <span>Error! Please try it later. </span>
gl: <span>Has enviado o feedback. </span> <span>Error! Por favor inténtalo máis tarde. </span>
