Repository: Djdany95/MyWatchList
Catalog: src/locale/messages.*.xlf
Languages: es, gl

# editHeader
source: Edit {{data.s.name}}
es: Editar {{data.s.name}}

# editContent
source: <mat-form-field> <input/> </mat-form-field> <mat-form-field> <input/> <mat-checkbox> On Air </mat-checkbox> </mat-form-field> <mat-form-field> <input/> <mat-error> Season is <strong>required</strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-error> Actual Episode is <strong>required</strong> </mat-error> </mat-form-field>
es: <mat-form-field> <input/> </mat-form-field> <mat-form-field> <input/> <mat-checkbox> En Emisión </mat-checkbox> </mat-form-field> <mat-form-field> <input/> <mat-error> Temporada es <strong> obligatoria </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-error> Episodio actual es <strong> obligatorio </strong> </mat-error> </mat-form-field>

# editName
source: Name
es: Nombre
gl: Nome

# editSeason
source: Season
es: Temporada
gl: Tempada

# editEpa
source: Actual Episode
es: Episodio Actual
gl: Episodio Actual

# editButtons
source: <button>Cancel</button> <button>Edit</button>
es: <button> Cancelar </button> <button> Editar </button>

# headerList
source: <button> <mat-icon>brightness_medium</mat-icon> </button> <span> <img/> <i>{{user.name | titlecase}}'s</i> List <button> <mat-icon>account_box</mat-icon> </button> </span> <button> <mat-icon>exit_to_app</mat-icon> </button>
es: <button> <mat-icon> brightness_medium </mat-icon> </button> <span> <img/> Lista de <i> {{user.name | titlecase}} </i> <button> <mat-icon> account_box </mat-icon> </button> </span> <button> <mat-icon> exit_to_app </mat-icon> </button>

# list
source: <div> <mat-form-field> <input/> <mat-placeholder>Filter</mat-placeholder> </mat-form-field> </div> <mat-table> <ng-container> <mat-header-cell> On Air </mat-header-cell> <mat-cell> <mat-icon>check_box</mat-icon> <mat-icon>indeterminate_check_box</mat-icon> </mat-cell> </ng-container> <ng-container> <mat-header-cell> Name </mat-header-cell> <mat-cell> {{element.name}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> Season </mat-header-cell> <mat-cell> {{element.temp}} <button> <mat-icon>add_circle </mat-icon> </button> </mat-cell> </ng-container> <ng-container> <mat-header-cell> Actual Episode </mat-header-cell> <mat-cell> {{element.epA}} <button> <mat-icon>add_circle </mat-icon> </button> </mat-cell> </ng-container> <ng-container> <mat-header-cell></mat-header-cell> <mat-cell> <button> <mat-icon>delete</mat-icon> </button> <button> <mat-icon>edit</mat-icon> </button> <button> <mat-icon>info</mat-icon> </button> </mat-cell> </ng-container> <mat-header-row></mat-header-row> <mat-row></mat-row> </mat-table>
es: <div> <mat-form-field> <input/> <mat-placeholder> Filtro </mat-placeholder> </mat-form-field> </div> <mat-table> <ng-container> <mat-header-cell> En emisión </mat-header-cell> <mat-cell> <mat-icon> check_box </mat-icon> <mat-icon> indeterminate_check_box </mat-icon> </mat-cell> </ng-container> <ng-container> <mat-header-cell> Nombre </mat-header-cell> <mat-cell> {{element.name}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> Temporada </mat-header-cell> <mat-cell> {{element.temp}} <button> <mat-icon> add_circle </mat-icon> </button> </mat-cell> </ng-container> <ng-container> <mat-header-cell> Episodio Actual </mat-header-cell> <mat-cell> {{element.epA}} <button> <mat-icon> add_circle </mat-icon> </button> </mat-cell> </ng-container> <ng-container> <mat-header-cell> </mat-header-cell> <mat-cell> <button> <mat-icon> delete </mat-icon> </button> <button> <mat-icon> edit </mat-icon> </button> <button> <mat-icon> info </mat-icon> </button> </mat-cell> </ng-container> <mat-header-row> </mat-header-row> <mat-row> </mat-row> </mat-table>

# listNSeries
source: Following {{nSeries}} series
es: Siguiendo {{nSeries}} series

# error500
source: <h1>ERROR 500</h1> <h2>RESTRICTED ACCESS TO USERS</h2>
es: <h1> ERROR 500 </h1> <h2> ACCESO RESTRINGIDO A USUARIOS </h2>

# listErrors
source: <span>Series is already in your list.</span> <span>Series doesn't exists.</span> <span> doesn't follow any series.</span> <span>Added success.</span> <span>Edited success.</span> <span>Deleted success.</span> <span>Logout success.</span>
es: <span> La serie ya está en tu lista. </span> <span> La serie no existe. </span> <span> no sigue ninguna serie. </span> <span> Añadida. </span> <span> Editada. </span> <span> Borrada. </span> <span> Sesión cerrada. </span>

# forgotHeader
source: Enter email to resend credentials
es: Introduce email para enviar credenciales
gl: Introduce email para enviar credenciales

# forgotContent
source: <mat-form-field> <input/> <mat-error> Email is <strong>required</strong> </mat-error> <mat-error> Email is <strong>incorrect</strong> </mat-error> </mat-form-field>
es: <mat-form-field> <input/> <mat-error> Email es <strong> obligatorio </strong> </mat-error> <mat-error> Email es <strong> incorrecto </strong> </mat-error> </mat-form-field>

# forgotButtons
source: <button>Cancel</button> <button>Send</button>
es: <button> Cancelar </button> <button> Enviar </button>

# loginHeader
source: Please Login
es: Inicia sesión
gl: Inicia sesión

# loginContent
source: <mat-form-field> <input/> <mat-error> Username is <strong>required</strong> </mat-error> <mat-error> Username is too <strong>short</strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-error> Password is <strong>required</strong> </mat-error> <mat-error> Password is too <strong>weak</strong> </mat-error> </mat-form-field>
es: <mat-form-field> <input/> <mat-error> Usuario es <strong> obligatorio </strong> </mat-error> <mat-error> Usuario es demasiado <strong> corto </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-error> Contraseña es <strong> obligatoria </strong> </mat-error> <mat-error> Contraseña es demasiado <strong> débil </strong> </mat-error> </mat-form-field>

# loginUser
source: Username
es: Usuario
gl: Usuario

# loginPass
source: Password
es: Contraseña
gl: Contrasinal

# forgot
source: <button>Forgot username or password?</button>
es: <button> ¿Olvidaste el usuario o contraseña? </button>

# loginButtons
source: <button>Cancel</button> <button>Login</button>
es: <button> Cancelar </button> <button> Iniciar sesión </button>

# introJumbo
source: <div> <button> <mat-icon>language</mat-icon> </button> <mat-menu> <button> <mat-icon>language</mat-icon> <span> <a>{{lang.label}}</a> </span> <span>{{lang.label}} </span> </button> </mat-menu> </div> <h1>Welcome to MyWatchList!</h1> <h1>Welcome to MyWatchList!</h1> <p>This is a simple page to track all Series you follow and share it with your friends.</p> <hr/> <br/> <h4>Register now to become a Lister</h4> <div> <app-register-form></app-register-form> </div> <br/> <br/> <br/>
es: <div> <button> <mat-icon>language</mat-icon> </button> <mat-menu> <button> <mat-icon>language</mat-icon> <span> <a>{{lang.label}}</a> </span> <span>{{lang.label}} </span> </button> </mat-menu> </div> <h1> ¡Bienvenido a MyWatchList! </h1> <h1> ¡Bienvenido a MyWatchList! </h1> <p> Esta es una simple web para hacer seguimiento de las series que sigues y compartirla con tus amigos. </p> <hr/> <br/> <h4> Regístrate ahora para ser un Lister </h4> <div> <app-register-form> </app-register-form> </div> <br/> <br/> <br/>

# introCookies
source: <div> <h5> <button> Cookies... </button> </h5> </div> <div> <div> <p> We use own cookies and third party cookies to obtain statistics data of our users and improve our services. If accepts or you continues navigating, we understund you accept their use. You can change configurations or obtain more information <a>here</a>. </p> <button> <span>OK</span> </button> </div> </div>
es: <div> <h5> <button> Cookies... </button> </h5> </div> <div> <div> <p>Utilizamos cookies propias y de terceros para obtener datos estadísticos de la navegación de nuestros usuarios y mejorar nuestros servicios. Si acepta o continúa navegando, consideramos que acepta su uso. Puede cambiar la configuración u obtener más información <a> aquí </a> . </p> <button> <span>OK</span> </button> </div> </div>

# introErrors
source: <span>Registered successfully. Please confirm email.</span> <span>Error! Please confirm email.</span> <span>Error! User or password are incorrect.</span> <span>Sent credentials to </span> <span>Error! Email doesn't exists.</span> <span>Server Error! Please try later.</span>
es: <span> ¡Registrado! Por favor confirma el email. </span> <span> ¡Error! Por favor confirma el email. </span> <span> ¡Error! Usuario o contraseña incorrectos. </span> <span> Enviadas credenciales a </span> <span> ¡Error! Email no existe. </span> <span> ¡Server Error! Por favor intentalo más tarde. </span>

# cookies
source: <p>In compliance with the provisions of article 22.2 of Law 34/2002, of July 11, Services of the Information Society and Electronic Commerce, this website informs you, in this section, about the <strong>cookie collection and treatment policy</strong>.</p> <p> </p> <h3><span>What are the cookies?</span></h3> <p><span>A cookie is a file that is downloaded to your computer when you access certain web pages. Cookies allow a web page, among other things, to store and retrieve information about the browsing habits of a user or their equipment and, depending on the information they contain and the way they use their equipment, they can be used to recognize to user.</span></p> <p> </p> <h3>What kind of cookies use this web?</h3> <p>This website uses the following types of cookies:</p> <p><span><strong>Analysis cookies</strong></span>: Are those that well treated by us or by third parties, allow us to quantify the number of users and thus perform the measurement and statistical analysis of the use made by users of the service offered. To do this, we analyze your browsing on our website in order to improve the offer of products or services we offer you.</p> <p><span><strong>Technical cookies</strong></span>: Are those that allow the user to navigate through the restricted area and the use of its different functions, such as, for example, bringing the process of purchasing an article.</p> <p><strong><span>Personalization cookies</span></strong>: Are those that allow the user to access the service with some predefined general characteristics based on a series of criteria in the user's terminal, such as the language or type of browser through which the user connects to the service.</p> <p><strong><span>Advertising cookies</span></strong>: Are those that, well treated by this website or by third parties, allow to manage in the most efficient way possible the offer of the advertising spaces that are on the web page, adapting the content of the advertisement to the content of the service requested or to the use made from our website. For this we can analyze your browsing habits on the Internet and we can show you advertisements related to your browsing profile.</p> <p><span><strong>Behavioral advertising cookies</strong></span>: Are those that allow the management, in the most efficient way possible, of the advertising spaces that, where appropriate, the editor has included in a web page, application or platform from which it provides the requested service. This type of cookies stores information on the behavior of visitors obtained through the continuous observation of their browsing habits, which allows the development of a specific profile to display advertisements based on it.</p> <p> </p> <h3>Deactivate cookies.</h3> <p>You can <strong>allow, block or delete cookies</strong> installed on your computer by configuring the browser options installed on your computer.</p> <p>In most web browsers the possibility of allowing, blocking or eliminating the cookies installed on your computer is offered.</p> <p>You can then access the configuration of the most frequent web browsers to accept, install or deactivate cookies:</p> <p><a>Configure cookies in Google Chrome</a></p> <p><a>Configure cookies in Microsoft Internet Explorer</a></p> <p><a>Configure cookies in Mozilla Firefox</a></p> <p><a>Configure cookies in Safari (Apple)</a></p> <p> </p> <h3>Third party cookies.</h3> <p>This website uses third-party services to collect information for statistical purposes and use of the web. DoubleClick cookies are used to improve the advertising that is included in the website. They are used to guide advertising according to the content that is relevant to a user, thus improving the quality of experience in its use.</p> <p>Specifically, we use Google Adsense and Google Analytics services for our statistics and advertising. Some cookies are essential for the operation of the site, for example the built-in search engine.</p> <p>Our site includes other features provided by third parties. You can easily share the content on social networks like Facebook, Twitter or Google +, with the buttons that we have included for that purpose.</p> <br/> <h4>Warning about deleting cookies.</h4> <p>You can delete and block all cookies from this site, but part of the site will not work or the quality of the website may be affected.</p> <button>I Undestand</button>
es: <p> En cumplimiento con lo dispuesto en el artículo 22.2 de la Ley 34/2002, de 11 de julio, de Servicios de la Sociedad de la Información y de Comercio Electrónico, esta página web le informa, en esta sección, sobre la <strong> política de recogida y tratamiento de cookies </strong> . </p> <p> </p> <h3> <span> ¿Qué son las cookies? </span> </h3> <p> <span> Una cookie es un fichero que se descarga en su ordenador al acceder a determinadas páginas web. Las cookies permiten a una página web, entre otras cosas, almacenar y recuperar información sobre los hábitos de navegación de un usuario o de su equipo y, dependiendo de la información que contengan y de la forma en que utilice su equipo, pueden utilizarse para reconocer al usuario. </span> </p> <p> </p> <h3> ¿Qué tipos de cookies utiliza esta página web? </h3> <p> Esta página web utiliza los siguientes tipos de cookies: </p> <p> <span> <strong> Cookies de análisis </strong> </span> : Son aquéllas que bien tratadas por nosotros o por terceros, nos permiten cuantificar el número de usuarios y así realizar la medición y análisis estadístico de la utilización que hacen los usuarios del servicio ofertado. Para ello se analiza su navegación en nuestra página web con el fin de mejorar la oferta de productos o servicios que le ofrecemos. </p> <p> <span> <strong> Cookies técnicas </strong> </span> : Son aquellas que permiten al usuario la navegación a través del área restringida y la utilización de sus diferentes funciones, como por ejemplo, llevar a cambio el proceso de compra de un artículo. </p> <p> <strong> <span> Cookies de personalización </span> </strong> : Son aquellas que permiten al usuario acceder al servicio con algunas características de carácter general predefinidas en función de una serie de criterios en el terminal del usuario como por ejemplo serian el idioma o el tipo de navegador a través del cual se conecta al servicio. </p> <p> <strong> <span> Cookies publicitarias </span> </strong> : Son aquéllas que, bien tratadas por esta web o por terceros, permiten gestionar de la forma más eficaz posible la oferta de los espacios publicitarios que hay en la página web, adecuando el contenido del anuncio al contenido del servicio solicitado o al uso que realice de nuestra página web. Para ello podemos analizar sus hábitos de navegación en Internet y podemos mostrarle publicidad relacionada con su perfil de navegación. </p> <p> <span> <strong> Cookies de publicidad comportamental </strong> </span> : Son aquellas que permiten la gestión, de la forma más eficaz posible, de los espacios publicitarios que, en su caso, el editor haya incluido en una página web, aplicación o plataforma desde la que presta el servicio solicitado. Este tipo de cookies almacenan información del comportamiento de los visitantes obtenida a través de la observación continuada de sus hábitos de navegación, lo que permite desarrollar un perfil específico para mostrar avisos publicitarios en función del mismo. </p> <p> </p> <h3> Desactivar las cookies. </h3> <p> Puede usted <strong> permitir, bloquear o eliminar las cookies </strong> instaladas en su equipo mediante la configuración de las opciones del navegador instalado en su ordenador. </p> <p> En la mayoría de los navegadores web se ofrece la posibilidad de permitir, bloquear o eliminar las cookies instaladas en su equipo. </p> <p> A continuación puede acceder a la configuración de los navegadores webs más frecuentes para aceptar, instalar o desactivar las cookies: </p> <p> <a> Configurar cookies en Google Chrome </a> </p> <p> <a> Configurar cookies en Microsoft Internet Explorer </a> </p> <p> <a> Configurar cookies en Mozilla Firefox </a> </p> <p> <a> Configurar cookies en Safari (Apple) </a> </p> <p> </p> <h3> Cookies de terceros. </h3> <p> Esta página web utiliza servicios de terceros para recopilar información con fines estadísticos y de uso de la web. Se usan cookies de DoubleClick para mejorar la publicidad que se incluye en el sitio web. Son utilizadas para orientar la publicidad según el contenido que es relevante para un usuario, mejorando así la calidad de experiencia en el uso del mismo. </p> <p> En concreto, usamos los servicios de Google Adsense y de Google Analytics para nuestras estadísticas y publicidad. Algunas cookies son esenciales para el funcionamiento del sitio, por ejemplo el buscador incorporado. </p> <p> Nuestro sitio incluye otras funcionalidades proporcionadas por terceros. Usted puede fácilmente compartir el contenido en redes sociales como Facebook, Twitter o Google +, con los botones que hemos incluido a tal efecto. </p> <br/> <h4> Advertencia sobre eliminar cookies. </h4> <p> Usted puede eliminar y bloquear todas las cookies de este sitio, pero parte del sitio no funcionará o la calidad de la página web puede verse afectada. </p> <button> Entendido </button>

# headerShared
source: <br/> <h3> <button> <mat-icon>brightness_medium</mat-icon> </button> <img/> <i>{{userName | titlecase}}'s</i> Shared List </h3> <mat-divider></mat-divider>
es: <br/> <h3> <button> <mat-icon> brightness_medium </mat-icon> </button> <img/> Lista compartida de <i> {{userName | titlecase}} </i> </h3> <mat-divider> </mat-divider>

# listShared
source: <div> <mat-form-field> <input/> <mat-placeholder>Filter</mat-placeholder> </mat-form-field> </div> <mat-table> <ng-container> <mat-header-cell> On Air </mat-header-cell> <mat-cell> <mat-icon>check_box</mat-icon> <mat-icon>indeterminate_check_box</mat-icon> </mat-cell> </ng-container> <ng-container> <mat-header-cell> Name </mat-header-cell> <mat-cell> {{element.name}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> Season </mat-header-cell> <mat-cell> {{element.temp}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> Actual Episode </mat-header-cell> <mat-cell> {{element.epA}} </mat-cell> </ng-container> <ng-container> <mat-header-cell></mat-header-cell> <mat-cell> <button> <mat-icon>info</mat-icon> </button> </mat-cell> </ng-container> <mat-header-row></mat-header-row> <mat-row></mat-row> </mat-table>
es: <div> <mat-form-field> <input/> <mat-placeholder> Filtro </mat-placeholder> </mat-form-field> </div> <mat-table> <ng-container> <mat-header-cell> En emisión </mat-header-cell> <mat-cell> <mat-icon> check_box </mat-icon> <mat-icon> indeterminate_check_box </mat-icon> </mat-cell> </ng-container> <ng-container> <mat-header-cell> Nombre </mat-header-cell> <mat-cell> {{element.name}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> Temporada </mat-header-cell> <mat-cell> {{element.temp}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> Episodio Actual </mat-header-cell> <mat-cell> {{element.epA}} </mat-cell> </ng-container> <ng-container> <mat-header-cell> </mat-header-cell> <mat-cell> <button> <mat-icon> info </mat-icon> </button> </mat-cell> </ng-container> <mat-header-row> </mat-header-row> <mat-row> </mat-row> </mat-table>

# shareNSeries
source: Following {{nSeries}} series
es: Siguiendo {{nSeries}} series

# shareErrors
source: <span> doesn't follow any series.</span> <span>Error! User doesn't exists.</span>
es: <span> no sigue ninguna serie. </span> <span> ¡Error! Usuario no existe. </span>

# profileHeader
source: <ng-progress></ng-progress> <br/> <h3> <button> <mat-icon>format_list_bulleted</mat-icon> </button> <img/> <i>{{user.name | titlecase}}'s</i> Profile <button> <mat-icon>exit_to_app</mat-icon> </button> </h3> <mat-divider></mat-divider> <span>Following {{nSeries}} series</span>
es: <br/> <h3> <button> <mat-icon> format_list_bulleted </mat-icon> </button> <img/> Perfil de <i> {{user.name | titlecase}} </i> <button> <mat-icon> exit_to_app </mat-icon> </button> </h3> <mat-divider> </mat-divider> <span> Siguiendo {{nSeries}} series </span>

# changePassForm
source: <mat-expansion-panel> <mat-expansion-panel-header> <mat-panel-title> Change Password </mat-panel-title> </mat-expansion-panel-header> <mat-form-field> <input/> <mat-placeholder>Actual Password</mat-placeholder> <mat-error> Password is <strong>required</strong> </mat-error> <mat-error> Password is too <strong>weak</strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-placeholder>New Password</mat-placeholder> <mat-error> Password is <strong>required</strong> </mat-error> <mat-error> Password is too <strong>weak</strong> </mat-error> </mat-form-field> <div> <button> Change Password <mat-icon>edit</mat-icon> </button> </div> </mat-expansion-panel>
es: <mat-expansion-panel> <mat-expansion-panel-header> <mat-panel-title> Cambiar contraseña </mat-panel-title> </mat-expansion-panel-header> <mat-form-field> <input/> <mat-placeholder> Contraseña actual </mat-placeholder> <mat-error> Contraseña es <strong> obligatoria </strong> </mat-error> <mat-error> Contraseña es demasiado <strong> débil </strong> </mat-error> </mat-form-field> <mat-form-field> <input/> <mat-placeholder> Nueva Contraseña </mat-placeholder> <mat-error> Contraseña es <strong> obligatoria </strong> </mat-error> <mat-error> Contraseña es demasiado <strong> débil </strong> </mat-error> </mat-form-field> <div> <button> Cambiar Contraseña <mat-icon> edit </mat-icon> </button> </div> </mat-expansion-panel>

# changeImageForm
source: <mat-expansion-panel> <mat-expansion-panel-header> <mat-panel-title> Change Profile Image </mat-panel-title> </mat-expansion-panel-header> <mat-form-field> <input/> <mat-placeholder>URL to image</mat-placeholder> <mat-error> URL is <strong>required</strong> </mat-error> <mat-error> URL is <strong>incorrect</strong> </mat-error> </mat-form-field> <div> <button> Change Profile Image <mat-icon>account_circle</mat-icon> </button> </div> </mat-expansion-panel>
es: <mat-expansion-panel> <mat-expansion-panel-header> <mat-panel-title> Cambiar imagen de perfil </mat-panel-title> </mat-expansion-panel-header> <mat-form-field> <input/> <mat-placeholder> URL de la imagen </mat-placeholder> <mat-error> URL es <strong> obligatoria </strong> </mat-error> <mat-error> URL es <strong> incorrecta </strong> </mat-error> </mat-form-field> <div> <button> Cambiar imagen de perfil <mat-icon> account_circle </mat-icon> </button> </div> </mat-expansion-panel>

# deleteModalButton
source: Delete Account
es: Borrar cuenta
gl: Borrar conta

# deleteModal
source: <div> <div> <div> <h5>Confirm Delete Account</h5> <button> <span>×</span> </button> </div> <div> Really do you want delete your account definitely? <br/> This can not be reversed! </div> <div> <button>Cancel</button> <button>Delete</button> </div> </div> </div>
es: <div> <div> <div> <h5> Confirmar borrado </h5> <button> <span> × </span> </button> </div> <div> ¿Realmente quieres borrar la cuenta? <br/> ¡Esto no puede revertirese! </div> <div> <button> Cancelar </button> <button> Borrar </button> </div> </div> </div>
